Revit 2026 API

# MetallicPaintMetallicpaintPearlColor Property

---

The property labeled "Color" from the "MetallicPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetallicpaintPearlColor { get; }
```
```vb
Public Shared ReadOnly Property MetallicpaintPearlColor As String
	Get
```
```cpp
public:
static property String^ MetallicpaintPearlColor {
	String^ get ();
}
```
```fsharp
static member MetallicpaintPearlColor : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

MetallicPaint Class

Autodesk.Revit.DB.Visual Namespace